In [1]:
import pandas as pd
import numpy as np

In [ ]:
#16. Напишите программу Pandas для сортировки DataFrame
#сначала по «имени» в порядке убывания, а затем по «счету» в порядке возрастания.

In [4]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
exam_data_data_frame = pd.DataFrame(exam_data)
exam_data_data_frame.sort_values(by = ['name','score'], ascending=[False, True])
exam_data_data_frame

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [5]:
#17. Напишите программу Pandas для замены столбца «уточнять», содержащего значения «да» и «нет» на «Истина» и «Ложь».

In [7]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
exam_data_df = pd.DataFrame(exam_data)
exam_data_df['qualify'] == 'yes'

0     True
1    False
2     True
3    False
4    False
5     True
6     True
7    False
8    False
9     True
Name: qualify, dtype: bool

In [8]:
#18.Напишите программу Pandas, чтобы изменить имя «Джеймс» на «Суреш» в столбце имени DataFrame.

In [12]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
exam_data_df = pd.DataFrame(exam_data)
exam_data_df['name'] = exam_data_df['name'].replace('James','Suresh')

In [13]:
#19. Напишите программу Pandas для удаления столбца «попытки» из блока данных.

In [27]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
exam_data_df = pd.DataFrame(exam_data)

In [28]:
exam_data_df.pop('attempts')
exam_data_df

        name  score qualify
0  Anastasia   12.5     yes
1       Dima    9.0      no
2  Katherine   16.5     yes
3      James    NaN      no
4      Emily    9.0      no
5    Michael   20.0     yes
6    Matthew   14.5     yes
7      Laura    NaN      no
8      Kevin    8.0      no
9      Jonas   19.0     yes

In [29]:
#20. Напишите программу Pandas для вставки нового столбца в существующий DataFrame.

In [35]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
exam_data_df = pd.DataFrame(exam_data)
exam_data_df['çolor'] = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']
exam_data_df

        name  score  attempts qualify   çolor
0  Anastasia   12.5         1     yes     Red
1       Dima    9.0         3      no    Blue
2  Katherine   16.5         2     yes  Orange
3      James    NaN         3      no     Red
4      Emily    9.0         2      no   White
5    Michael   20.0         3     yes   White
6    Matthew   14.5         1     yes    Blue
7      Laura    NaN         1      no   Green
8      Kevin    8.0         2      no   Green
9      Jonas   19.0         1     yes     Red

In [ ]:
#21. Напишите программу Pandas для итерации по строкам в DataFrame.

In [40]:
exam_data = [{'name':'Anastasia', 'score':12.5}, {'name':'Dima','score':9}, {'name':'Katherine','score':16.5}]
df = pd.DataFrame(exam_data)
for index, row in df.iterrows():
    print(row['name'], row['score'])
df

Anastasia 12.5
Dima 9.0
Katherine 16.5

        name  score
0  Anastasia   12.5
1       Dima    9.0
2  Katherine   16.5

In [41]:
#22. Напишите программу Pandas, чтобы получить список из заголовков столбцов DataFrame.

In [46]:
exam_data = [{'name':'Anastasia', 'score':12.5}, {'name':'Dima','score':9}, {'name':'Katherine','score':16.5}]
df = pd.DataFrame(exam_data)
print(list(df.columns.values))

['name', 'score']

In [47]:
#24. Напишите программу Pandas для выбора строк из данного DataFrame на основе значений в некоторых столбцах.

In [ ]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
exam_data_df = pd.DataFrame(exam_data)